nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # P2
  - [-1, 1, Conv, [64, 3, 2]]       
  - [-1, 1, Conv, [128, 3, 2]]      
  - [-1, 3, C2f_ESEMB, [128, True]] 
  - [-1, 1, ACmix, [128]]           

  # P3
  - [-1, 1, Conv, [256, 3, 2]]      
  - [-1, 6, C2f_ESEMB, [256, True]] 
  - [-1, 1, ACmix, [256]]           

  # P4
  - [-1, 1, Conv, [512, 3, 2]]      
  - [-1, 6, C2f, [512, True]]       
  - [-1, 1, ACmix, [512]]           

  # P5
  - [-1, 1, Conv, [1024, 3, 2]]     
  - [-1, 3, C2f_Faster, [1024, True]]
  - [-1, 1, ACmix, [1024]]          
  - [-1, 1, SPPF, [1024, 5]]        

head:
  # Top-down P5->P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  
  - [[-1, 9], 1, Concat, [1]]                   
  - [-1, 3, C2f, [512]]                         

  # P4->P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  
  - [[-1, 6], 1, Concat, [1]]                   
  - [-1, 3, C2f, [256]]                         

  # P3->P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  
  - [[-1, 3], 1, Concat, [1]]                   
  - [-1, 3, C2f, [128]]                         

  # Bottom-up
  - [-1, 1, Conv, [128, 3, 2]]                  
  - [[-1, 19], 1, Concat, [1]]                  
  - [-1, 3, C2f, [256]]                         

  - [-1, 1, Conv, [256, 3, 2]]                  
  - [[-1, 16], 1, Concat, [1]]                  
  - [-1, 3, C2f, [512]]                         

  - [-1, 1, Conv, [512, 3, 2]]                  
  - [[-1, 13], 1, Concat, [1]]                  
  - [-1, 3, C2f_Faster, [1024]]                 

  - [[22, 25, 28, 31], 1, CLLADetect, [nc]]    
