# Ultralytics YOLOv8 + ACmix (Small Object Enhanced)
nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]            # 0
  - [-1, 1, Conv, [128, 3, 2]]           # 1
  - [-1, 3, C2f, [128, True]]            # 2

  - [-1, 1, Conv, [256, 3, 2]]           # 3
  - [-1, 6, C2f, [256, True]]            # 4
  - [-1, 1, ACmix, [256]]                # 5  ⭐ P3 ACmix (强力提升小目标)

  - [-1, 1, Conv, [512, 3, 2]]           # 6
  - [-1, 6, C2f, [512, True]]            # 7
  - [-1, 1, ACmix, [512]]                # 8  ⭐ P4 ACmix (中小目标提升)

  - [-1, 1, Conv, [1024, 3, 2]]          # 9
  - [-1, 3, C2f, [1024, True]]           # 10
  - [-1, 1, SPPF, [1024, 5]]             # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 12
  - [[-1, 8], 1, Concat, [1]]                      # 13: SPPF↑ + P4
  - [-1, 3, C2f, [512]]                            # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 15
  - [[-1, 5], 1, Concat, [1]]                      # 16: P4↑ + P3
  - [-1, 3, C2f, [256]]                            # 17  # P3 out

  - [-1, 1, Conv, [256, 3, 2]]                     # 18
  - [[-1, 14], 1, Concat, [1]]                     # 19
  - [-1, 3, C2f, [512]]                            # 20  # P4 out

  - [-1, 1, Conv, [512, 3, 2]]                     # 21
  - [[-1, 11], 1, Concat, [1]]                     # 22
  - [-1, 3, C2f, [1024]]                           # 23  # P5 out

  - [[17, 20, 23], 1, Detect, [nc]]
