# Ultralytics YOLOv8 + ACmix (indices fixed)

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0
  - [-1, 1, Conv, [128, 3, 2]]         # 1
  - [-1, 3, C2f, [128, True]]          # 2
  - [-1, 1, ACmix, [128]]              # 3

  - [-1, 1, Conv, [256, 3, 2]]         # 4
  - [-1, 6, C2f, [256, True]]          # 5
  - [-1, 1, ACmix, [256]]              # 6

  - [-1, 1, Conv, [512, 3, 2]]         # 7
  - [-1, 6, C2f, [512, True]]          # 8
  - [-1, 1, ACmix, [512]]              # 9

  - [-1, 1, Conv, [1024, 3, 2]]        # 10
  - [-1, 3, C2f, [1024, True]]         # 11
  - [-1, 1, ACmix, [1024]]             # 12

  - [-1, 1, SPPF, [1024, 5]]           # 13

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14 (upsample SPPF)
  - [[-1, 9], 1, Concat, [1]]                   # 15 <-- use backbone ACmix 512 (idx 9)
  - [-1, 3, C2f, [512]]                         # 16
  - [-1, 1, ACmix, [512]]                       # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18 (upsample head P4)
  - [[-1, 6], 1, Concat, [1]]                   # 19 <-- use backbone ACmix 256 (idx 6)
  - [-1, 3, C2f, [256]]                         # 20
  - [-1, 1, ACmix, [256]]                       # 21

  - [-1, 1, Conv, [256, 3, 2]]                  # 22 (downsample)
  - [[-1, 17], 1, Concat, [1]]                  # 23 <-- concat with head P4 output (idx 17)
  - [-1, 3, C2f, [512]]                         # 24
  - [-1, 1, ACmix, [512]]                       # 25

  - [-1, 1, Conv, [512, 3, 2]]                  # 26 (downsample)
  - [[-1, 12], 1, Concat, [1]]                  # 27 <-- concat with backbone ACmix 1024 (idx 12)
  - [-1, 3, C2f, [1024]]                        # 28
  - [-1, 1, ACmix, [1024]]                      # 29

  - [[21, 25, 29], 1, Detect, [nc]]             # Detect(P3, P4, P5)
