# Ultralytics YOLOv8 + ACmix (indices fixed)

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]            # 0
  - [-1, 1, Conv, [128, 3, 2]]           # 1
  - [-1, 3, C2f, [128, True]]            # 2
  - [-1, 1, ACmix, [128]]                # 3

  - [-1, 1, Conv, [256, 3, 2]]           # 4
  - [-1, 6, C2f, [256, True]]            # 5
  - [-1, 1, ACmix, [256]]                # 6  ← P3

  - [-1, 1, Conv, [512, 3, 2]]           # 7
  - [-1, 6, C2f, [512, True]]            # 8
  - [-1, 1, ACmix, [512]]                # 9  ← P4

  - [-1, 1, Conv, [1024, 3, 2]]          # 10
  - [-1, 3, C2f, [1024, True]]           # 11
  - [-1, 1, ACmix, [1024]]               # 12 ← P5

  - [-1, 1, SPPF, [1024, 5]]             # 13

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 9], 1, Concat, [1]]                    # 15: SPPF↑ + P4
  - [-1, 3, C2f, [512]]                          # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17
  - [[-1, 6], 1, Concat, [1]]                    # 18: P4↑ + P3
  - [-1, 3, C2f, [256]]                          # 19  ← P3 Output (for Detect)

  - [-1, 1, Conv, [256, 3, 2]]                   # 20
  - [[-1, 16], 1, Concat, [1]]                   # 21
  - [-1, 3, C2f, [512]]                          # 22 ← P4 Output

  - [-1, 1, Conv, [512, 3, 2]]                   # 23
  - [[-1, 13], 1, Concat, [1]]                   # 24  concat with SPPF output
  - [-1, 3, C2f, [1024]]                         # 25 ← P5 Output

  - [[19, 22, 25], 1, Detect, [nc]]